app/views/users/show.html.erb

					<tbody>
						<% @user.another_addresses.each do |another_address| %>
---
SELECT "another_addresses".* FROM "another_addresses" WHERE "another_addresses"."user_id" = ?  [["user_id", 3]]