app/views/items/_form.html.erb

                <br>
                    <%= form.select :genre_id, Genre.all.collect { |p| [ p.genre, p.id ] }, {include_blank: true}, {class: 'col-lg-12 col-xs-12'} %>
---
SELECT "genres".* FROM "genres"

                <br>
                    <%= form.select :label_id,  Label.all.collect { |p| [ p.label, p.id ] }, {include_blank: true}, {class: 'col-lg-12 col-xs-12'} %>
---
SELECT "labels".* FROM "labels"

            <br>
                <%= form.select  :artist_id,  Artist.all.collect { |p| [ p.artist, p.id ] }, {include_blank: true}, {class: 'col-lg-12 col-xs-12'} %>
---
SELECT "artists".* FROM "artists"