app/views/items/edit.html.erb

SELECT "genres".* FROM "genres"
SELECT "labels".* FROM "labels"
---
            在庫数<%= f.input :stock %>
            ジャンル<%= f.collection_select  :genre_id,  Genre.all, :id, :genre %>
            レーベル<%= f.collection_select  :label_id,  Label.all, :id, :label %>

SELECT "artists".* FROM "artists"
---
            タイトル<%= f.input :cd_name %>
            アーティスト<%= f.collection_select  :artist_id,  Artist.all, :id, :artist %>