app/views/items/new.html.erb

    genre
    <%= f.collection_select  :genre_id,  Genre.all, :id, :genre %>
    artist
    <%= f.collection_select  :artist_id,  Artist.all, :id, :artist %>
    label
    <%= f.collection_select  :label_id,  Label.all, :id, :label %>
---
SELECT "genres".* FROM "genres"
SELECT "artists".* FROM "artists"
SELECT "labels".* FROM "labels"