app/views/items/show.html.erb

>>>>>>> master
            <% @item.discs.each do |dis| %>
---
SELECT "discs".* FROM "discs" WHERE "discs"."item_id" = ?  [["item_id", 11]]