app/controllers/another_addresses_controller.rb

  def create
  	@another_address = AnotherAddress.new(another_address_params)
    @another_address.user_id = current_user.id
    if @another_address.save
---
INSERT INTO "another_addresses" ("user_id", "another_last_name", "another_first_name", "another_last_name_kana", "another_first_name_kana", "address_name", "another_postcode", "another_prefecture", "another_city", "another_block", "another_building", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
  	@another_address = AnotherAddress.find(params[:id])
---
SELECT  "another_addresses".* FROM "another_addresses" WHERE "another_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	@another_address = AnotherAddress.find(params[:id])
    if @another_address.user_id == current_user.id && @another_address.update(another_address_params)
---
SELECT  "another_addresses".* FROM "another_addresses" WHERE "another_addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "another_addresses" SET "another_postcode" = ?, "updated_at" = ? WHERE "another_addresses"."id" = ?  [["another_postcode", "2222222"], ["updated_at", "2019-06-09 20:28:26.897196"], ["id", 3]]

  def destroy
  	@another_address = AnotherAddress.find(params[:id])
    if @another_address.destroy
---
SELECT  "another_addresses".* FROM "another_addresses" WHERE "another_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "another_addresses" WHERE "another_addresses"."id" = ?  [["id", 1]]