app/controllers/artists_controller.rb

INSERT INTO "artists" ("artist", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist", "x"], ["created_at", "2019-06-04 10:25:11.024219"], ["updated_at", "2019-06-04 10:25:11.024219"]]
---
    def create
        @artist = Artist.new(params_artist)
        @artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @artist = Artist.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "artist" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["artist", "xx"], ["updated_at", "2019-06-04 10:35:50.497582"], ["id", 1]]
---
    def update
        @artist = Artist.find(params[:id])
        @artist.update(params_artist)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
---
    def destroy
        @artist = Artist.find(params[:id])
        @artist.destroy