app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
  	@contacts = Contact.all

INSERT INTO "contacts" ("contact_content", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["contact_content", "仮想通貨でお支払いはできるでしょうか？"], ["category", "お支払い方法について"], ["created_at", "2019-06-09 09:49:00.756427"], ["updated_at", "2019-06-09 09:49:00.756427"]]
---
  def create
  	@contact = Contact.new(contact_params)
  	if @contact.save