app/controllers/genres_controller.rb

INSERT INTO "genres" ("genre", "created_at", "updated_at") VALUES (?, ?, ?)  [["genre", "d"], ["created_at", "2019-06-04 10:27:41.306440"], ["updated_at", "2019-06-04 10:27:41.306440"]]
---
    def create
        genre = Genre.new(genre_params)
        genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "genre" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["genre", "dz"], ["updated_at", "2019-06-04 10:32:34.936648"], ["id", 1]]
---
    def update
        genre = Genre.find(params[:id])
        genre.update(genre_params)

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
    def destroy
        @genre = Genre.find(params[:id])
        @genre.destroy