app/controllers/items_controller.rb

INSERT INTO "items" ("jacket_image_id", "genre_id", "artist_id", "label_id", "cd_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["jacket_image_id", nil], ["genre_id", 2], ["artist_id", 2], ["label_id", 3], ["cd_name", ""], ["created_at", "2019-06-06 09:59:11.500408"], ["updated_at", "2019-06-06 09:59:11.500408"]]
---
    def create
        @item = Item.new(item_params)
        # binding.pry
        if @item.save

SELECT "items".* FROM "items"
---
    def index
        @items = Item.paginate(page: params[:page], per_page: 20)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."item_id" = ? AND "discs"."id" = ?  [["item_id", 6], ["id", 15]]
---
    def show
        @item = Item.find(params[:id])
        @cart_item = @item.cart_items.new
        @discs = @item.discs.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "price" = ?, "jacket_image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", 5], ["jacket_image_id", "4efe5640a13f9930157ee6b63ac29997a7d5174481892acc8ccd66d544ec"], ["updated_at", "2019-06-07 07:12:56.458860"], ["id", 4]]
---
    def update
        @item = Item.find(params[:id])
        if @item.update(item_params)