app/controllers/items_controller.rb

    def edit
        @item = Item.find(params[:id])
        @genres = Genre.all
---
SELECT "genres".* FROM "genres"