app/controllers/labels_controller.rb

    def create
        label = Label.new(label_params)
        label.save
---
INSERT INTO "labels" ("label", "created_at", "updated_at") VALUES (?, ?, ?)  [["label", "s"], ["created_at", "2019-06-04 10:18:08.754848"], ["updated_at", "2019-06-04 10:18:08.754848"]]

    def edit
        @label = Label.find(params[:id])
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @label = Label.find(params[:id])
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @label = Label.find(params[:id])
        @label.destroy
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 1]]