app/controllers/users_controller.rb

INSERT INTO "another_addresses" ("user_id", "another_last_name", "another_first_name", "another_last_name_kana", "another_first_name_kana", "another_postcode", "another_prefecture", "another_city", "another_block", "another_building", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def another_address_create
    @another_address = AnotherAddress.new(another_address_params)
    @another_address.user_id = current_user.id
    if @another_address.save