app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def address_edit
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "block" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["block", "6-8"], ["updated_at", "2019-06-09 19:00:29.773186"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user == current_user && @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = User.find(params[:id])
    if @user.destroy

INSERT INTO "another_addresses" ("user_id", "another_last_name", "another_first_name", "another_last_name_kana", "another_first_name_kana", "address_name", "another_postcode", "another_prefecture", "another_city", "another_block", "another_building", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def another_address_create
    @another_address = AnotherAddress.new(another_address_params)
    @another_address.user_id = current_user.id
    if @another_address.save